programmingprojects/flutterprojects/Streamline/AOE_MOSAIC_APP-mega_super_commenting_speed_ultra_branch_wow_amazing_good_stuff/example_SOAP_API_calls/ManageServiceProvisioning/retrieveService - serial number.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:mod="http://models.ws.common.adtran.com"
xmlns:ns0="http://serviceactivation.models.ws.common.adtran.com">

   <soapenv:Header>
      <mod:aoewsHeader>
         <aoewss>
            <userName>admin</userName>
            <password>password</password>
         </aoewss>
      </mod:aoewsHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ns0:retrieveServiceRequest>
		<serialNumberWrapper>
			<serialNumber>abcd12345678</serialNumber>
		</serialNumberWrapper>
      </ns0:retrieveServiceRequest>
   </soapenv:Body>
</soapenv:Envelope>